OpenFOAM-13/tutorials/multiphaseEuler/steamInjection/constant/heatTransfer
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      heatTransfer;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

blending        default;

steam_dispersedIn_water_inThe_steam
{
    type            spherical;
    residualAlpha   1e-3;
}

steam_dispersedIn_water_inThe_water
{
    type            RanzMarshall;
    residualAlpha   1e-3;
}

// ************************************************************************* //
