OpenFOAM-13/tutorials/multiphaseEuler/steamInjection/constant/phaseProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      phaseProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

phases          (steam water);

steam
{
    type            purePhaseModel;

    diameterModel   isothermal;
    isothermalCoeffs
    {
        d0              3e-3;
        p0              1e5;
    }

    residualAlpha   1e-3;
}

water
{
    type            purePhaseModel;

    diameterModel   none;

    residualAlpha   1e-3;
}

blending
{
    default
    {
        type            continuous;
        phase           water;
    }
}

surfaceTension
{}

// ************************************************************************* //
